yuplus/nxp-mcx-series/MCXE247/periph0/PERI_AIPS.h
/*! @name OPACRD - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRD_TP5_MASK                     (0x100U)
#define AIPS_OPACRD_TP5_SHIFT                    (8U)
/*! TP5 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRD_TP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_TP5_SHIFT)) & AIPS_OPACRD_TP5_MASK)

#define AIPS_OPACRD_WP5_MASK                     (0x200U)
#define AIPS_OPACRD_WP5_SHIFT                    (9U)
/*! WP5 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRD_WP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_WP5_SHIFT)) & AIPS_OPACRD_WP5_MASK)

#define AIPS_OPACRD_SP5_MASK                     (0x400U)
#define AIPS_OPACRD_SP5_SHIFT                    (10U)
/*! SP5 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRD_SP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_SP5_SHIFT)) & AIPS_OPACRD_SP5_MASK)

#define AIPS_OPACRD_TP3_MASK                     (0x10000U)
#define AIPS_OPACRD_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRD_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_TP3_SHIFT)) & AIPS_OPACRD_TP3_MASK)

#define AIPS_OPACRD_WP3_MASK                     (0x20000U)
#define AIPS_OPACRD_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRD_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_WP3_SHIFT)) & AIPS_OPACRD_WP3_MASK)

#define AIPS_OPACRD_SP3_MASK                     (0x40000U)
#define AIPS_OPACRD_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRD_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_SP3_SHIFT)) & AIPS_OPACRD_SP3_MASK)

#define AIPS_OPACRD_TP2_MASK                     (0x100000U)
#define AIPS_OPACRD_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRD_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_TP2_SHIFT)) & AIPS_OPACRD_TP2_MASK)

#define AIPS_OPACRD_WP2_MASK                     (0x200000U)
#define AIPS_OPACRD_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRD_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_WP2_SHIFT)) & AIPS_OPACRD_WP2_MASK)

#define AIPS_OPACRD_SP2_MASK                     (0x400000U)
#define AIPS_OPACRD_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRD_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_SP2_SHIFT)) & AIPS_OPACRD_SP2_MASK)

#define AIPS_OPACRD_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRD_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRD_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_TP1_SHIFT)) & AIPS_OPACRD_TP1_MASK)

#define AIPS_OPACRD_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRD_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRD_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_WP1_SHIFT)) & AIPS_OPACRD_WP1_MASK)

#define AIPS_OPACRD_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRD_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRD_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_SP1_SHIFT)) & AIPS_OPACRD_SP1_MASK)

#define AIPS_OPACRD_TP0_MASK                     (0x10000000U)
#define AIPS_OPACRD_TP0_SHIFT                    (28U)
/*! TP0 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRD_TP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_TP0_SHIFT)) & AIPS_OPACRD_TP0_MASK)

#define AIPS_OPACRD_WP0_MASK                     (0x20000000U)
#define AIPS_OPACRD_WP0_SHIFT                    (29U)
/*! WP0 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRD_WP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_WP0_SHIFT)) & AIPS_OPACRD_WP0_MASK)

#define AIPS_OPACRD_SP0_MASK                     (0x40000000U)
#define AIPS_OPACRD_SP0_SHIFT                    (30U)
/*! SP0 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRD_SP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRD_SP0_SHIFT)) & AIPS_OPACRD_SP0_MASK)
/*! @} */

/*! @name OPACRE - Off-Platform Peripheral Access Control Register */
/*! @{ */

