yuplus/nxp-mcx-series/MCXE247/periph0/PERI_AIPS.h
#define AIPS_OPACRE_TP6_MASK                     (0x10U)
#define AIPS_OPACRE_TP6_SHIFT                    (4U)
/*! TP6 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRE_TP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_TP6_SHIFT)) & AIPS_OPACRE_TP6_MASK)

#define AIPS_OPACRE_WP6_MASK                     (0x20U)
#define AIPS_OPACRE_WP6_SHIFT                    (5U)
/*! WP6 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRE_WP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_WP6_SHIFT)) & AIPS_OPACRE_WP6_MASK)

#define AIPS_OPACRE_SP6_MASK                     (0x40U)
#define AIPS_OPACRE_SP6_SHIFT                    (6U)
/*! SP6 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRE_SP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_SP6_SHIFT)) & AIPS_OPACRE_SP6_MASK)

#define AIPS_OPACRE_TP0_MASK                     (0x10000000U)
#define AIPS_OPACRE_TP0_SHIFT                    (28U)
/*! TP0 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRE_TP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_TP0_SHIFT)) & AIPS_OPACRE_TP0_MASK)

#define AIPS_OPACRE_WP0_MASK                     (0x20000000U)
#define AIPS_OPACRE_WP0_SHIFT                    (29U)
/*! WP0 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRE_WP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_WP0_SHIFT)) & AIPS_OPACRE_WP0_MASK)

#define AIPS_OPACRE_SP0_MASK                     (0x40000000U)
#define AIPS_OPACRE_SP0_SHIFT                    (30U)
/*! SP0 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRE_SP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRE_SP0_SHIFT)) & AIPS_OPACRE_SP0_MASK)
/*! @} */

/*! @name OPACRF - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRF_TP5_MASK                     (0x100U)
#define AIPS_OPACRF_TP5_SHIFT                    (8U)
/*! TP5 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP5_SHIFT)) & AIPS_OPACRF_TP5_MASK)

#define AIPS_OPACRF_WP5_MASK                     (0x200U)
#define AIPS_OPACRF_WP5_SHIFT                    (9U)
/*! WP5 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP5_SHIFT)) & AIPS_OPACRF_WP5_MASK)

#define AIPS_OPACRF_SP5_MASK                     (0x400U)
#define AIPS_OPACRF_SP5_SHIFT                    (10U)
/*! SP5 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP5_SHIFT)) & AIPS_OPACRF_SP5_MASK)

#define AIPS_OPACRF_TP4_MASK                     (0x1000U)
#define AIPS_OPACRF_TP4_SHIFT                    (12U)
/*! TP4 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP4_SHIFT)) & AIPS_OPACRF_TP4_MASK)

#define AIPS_OPACRF_WP4_MASK                     (0x2000U)
#define AIPS_OPACRF_WP4_SHIFT                    (13U)
/*! WP4 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP4_SHIFT)) & AIPS_OPACRF_WP4_MASK)

#define AIPS_OPACRF_SP4_MASK                     (0x4000U)
#define AIPS_OPACRF_SP4_SHIFT                    (14U)
/*! SP4 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP4_SHIFT)) & AIPS_OPACRF_SP4_MASK)

#define AIPS_OPACRF_TP3_MASK                     (0x10000U)
#define AIPS_OPACRF_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP3_SHIFT)) & AIPS_OPACRF_TP3_MASK)

#define AIPS_OPACRF_WP3_MASK                     (0x20000U)
#define AIPS_OPACRF_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP3_SHIFT)) & AIPS_OPACRF_WP3_MASK)

#define AIPS_OPACRF_SP3_MASK                     (0x40000U)
#define AIPS_OPACRF_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP3_SHIFT)) & AIPS_OPACRF_SP3_MASK)

#define AIPS_OPACRF_TP2_MASK                     (0x100000U)
#define AIPS_OPACRF_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP2_SHIFT)) & AIPS_OPACRF_TP2_MASK)

