yuplus/nxp-mcx-series/MCXE247/periph0/PERI_AIPS.h
#define AIPS_OPACRF_WP2_MASK                     (0x200000U)
#define AIPS_OPACRF_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP2_SHIFT)) & AIPS_OPACRF_WP2_MASK)

#define AIPS_OPACRF_SP2_MASK                     (0x400000U)
#define AIPS_OPACRF_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP2_SHIFT)) & AIPS_OPACRF_SP2_MASK)

#define AIPS_OPACRF_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRF_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP1_SHIFT)) & AIPS_OPACRF_TP1_MASK)

#define AIPS_OPACRF_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRF_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP1_SHIFT)) & AIPS_OPACRF_WP1_MASK)

#define AIPS_OPACRF_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRF_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP1_SHIFT)) & AIPS_OPACRF_SP1_MASK)

#define AIPS_OPACRF_TP0_MASK                     (0x10000000U)
#define AIPS_OPACRF_TP0_SHIFT                    (28U)
/*! TP0 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRF_TP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_TP0_SHIFT)) & AIPS_OPACRF_TP0_MASK)

#define AIPS_OPACRF_WP0_MASK                     (0x20000000U)
#define AIPS_OPACRF_WP0_SHIFT                    (29U)
/*! WP0 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRF_WP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_WP0_SHIFT)) & AIPS_OPACRF_WP0_MASK)

#define AIPS_OPACRF_SP0_MASK                     (0x40000000U)
#define AIPS_OPACRF_SP0_SHIFT                    (30U)
/*! SP0 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRF_SP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRF_SP0_SHIFT)) & AIPS_OPACRF_SP0_MASK)
/*! @} */

/*! @name OPACRG - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRG_TP5_MASK                     (0x100U)
#define AIPS_OPACRG_TP5_SHIFT                    (8U)
/*! TP5 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRG_TP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_TP5_SHIFT)) & AIPS_OPACRG_TP5_MASK)

#define AIPS_OPACRG_WP5_MASK                     (0x200U)
#define AIPS_OPACRG_WP5_SHIFT                    (9U)
/*! WP5 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRG_WP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_WP5_SHIFT)) & AIPS_OPACRG_WP5_MASK)

#define AIPS_OPACRG_SP5_MASK                     (0x400U)
#define AIPS_OPACRG_SP5_SHIFT                    (10U)
/*! SP5 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRG_SP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_SP5_SHIFT)) & AIPS_OPACRG_SP5_MASK)

#define AIPS_OPACRG_TP4_MASK                     (0x1000U)
#define AIPS_OPACRG_TP4_SHIFT                    (12U)
/*! TP4 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRG_TP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_TP4_SHIFT)) & AIPS_OPACRG_TP4_MASK)

#define AIPS_OPACRG_WP4_MASK                     (0x2000U)
#define AIPS_OPACRG_WP4_SHIFT                    (13U)
/*! WP4 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRG_WP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_WP4_SHIFT)) & AIPS_OPACRG_WP4_MASK)

#define AIPS_OPACRG_SP4_MASK                     (0x4000U)
#define AIPS_OPACRG_SP4_SHIFT                    (14U)
/*! SP4 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRG_SP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_SP4_SHIFT)) & AIPS_OPACRG_SP4_MASK)

#define AIPS_OPACRG_TP2_MASK                     (0x100000U)
#define AIPS_OPACRG_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRG_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_TP2_SHIFT)) & AIPS_OPACRG_TP2_MASK)

#define AIPS_OPACRG_WP2_MASK                     (0x200000U)
#define AIPS_OPACRG_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRG_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_WP2_SHIFT)) & AIPS_OPACRG_WP2_MASK)

#define AIPS_OPACRG_SP2_MASK                     (0x400000U)
#define AIPS_OPACRG_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRG_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRG_SP2_SHIFT)) & AIPS_OPACRG_SP2_MASK)
/*! @} */

