yuplus/nxp-mcx-series/MCXE247/periph0/PERI_AIPS.h
/*! @name OPACRH - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRH_TP2_MASK                     (0x100000U)
#define AIPS_OPACRH_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRH_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRH_TP2_SHIFT)) & AIPS_OPACRH_TP2_MASK)

#define AIPS_OPACRH_WP2_MASK                     (0x200000U)
#define AIPS_OPACRH_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRH_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRH_WP2_SHIFT)) & AIPS_OPACRH_WP2_MASK)

#define AIPS_OPACRH_SP2_MASK                     (0x400000U)
#define AIPS_OPACRH_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRH_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRH_SP2_SHIFT)) & AIPS_OPACRH_SP2_MASK)
/*! @} */

/*! @name OPACRI - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRI_TP7_MASK                     (0x1U)
#define AIPS_OPACRI_TP7_SHIFT                    (0U)
/*! TP7 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP7_SHIFT)) & AIPS_OPACRI_TP7_MASK)

#define AIPS_OPACRI_WP7_MASK                     (0x2U)
#define AIPS_OPACRI_WP7_SHIFT                    (1U)
/*! WP7 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP7_SHIFT)) & AIPS_OPACRI_WP7_MASK)

#define AIPS_OPACRI_SP7_MASK                     (0x4U)
#define AIPS_OPACRI_SP7_SHIFT                    (2U)
/*! SP7 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP7_SHIFT)) & AIPS_OPACRI_SP7_MASK)

#define AIPS_OPACRI_TP6_MASK                     (0x10U)
#define AIPS_OPACRI_TP6_SHIFT                    (4U)
/*! TP6 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP6_SHIFT)) & AIPS_OPACRI_TP6_MASK)

#define AIPS_OPACRI_WP6_MASK                     (0x20U)
#define AIPS_OPACRI_WP6_SHIFT                    (5U)
/*! WP6 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP6_SHIFT)) & AIPS_OPACRI_WP6_MASK)

#define AIPS_OPACRI_SP6_MASK                     (0x40U)
#define AIPS_OPACRI_SP6_SHIFT                    (6U)
/*! SP6 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP6_SHIFT)) & AIPS_OPACRI_SP6_MASK)

#define AIPS_OPACRI_TP5_MASK                     (0x100U)
#define AIPS_OPACRI_TP5_SHIFT                    (8U)
/*! TP5 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP5_SHIFT)) & AIPS_OPACRI_TP5_MASK)

#define AIPS_OPACRI_WP5_MASK                     (0x200U)
#define AIPS_OPACRI_WP5_SHIFT                    (9U)
/*! WP5 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP5_SHIFT)) & AIPS_OPACRI_WP5_MASK)

#define AIPS_OPACRI_SP5_MASK                     (0x400U)
#define AIPS_OPACRI_SP5_SHIFT                    (10U)
/*! SP5 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP5_SHIFT)) & AIPS_OPACRI_SP5_MASK)

#define AIPS_OPACRI_TP4_MASK                     (0x1000U)
#define AIPS_OPACRI_TP4_SHIFT                    (12U)
/*! TP4 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP4_SHIFT)) & AIPS_OPACRI_TP4_MASK)

#define AIPS_OPACRI_WP4_MASK                     (0x2000U)
#define AIPS_OPACRI_WP4_SHIFT                    (13U)
/*! WP4 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP4_SHIFT)) & AIPS_OPACRI_WP4_MASK)

#define AIPS_OPACRI_SP4_MASK                     (0x4000U)
#define AIPS_OPACRI_SP4_SHIFT                    (14U)
/*! SP4 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP4_SHIFT)) & AIPS_OPACRI_SP4_MASK)

#define AIPS_OPACRI_TP3_MASK                     (0x10000U)
#define AIPS_OPACRI_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP3_SHIFT)) & AIPS_OPACRI_TP3_MASK)

#define AIPS_OPACRI_WP3_MASK                     (0x20000U)
#define AIPS_OPACRI_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP3_SHIFT)) & AIPS_OPACRI_WP3_MASK)

