yuplus/nxp-mcx-series/MCXE247/periph0/PERI_AIPS.h
#define AIPS_OPACRJ_WP2_MASK                     (0x200000U)
#define AIPS_OPACRJ_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRJ_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_WP2_SHIFT)) & AIPS_OPACRJ_WP2_MASK)

#define AIPS_OPACRJ_SP2_MASK                     (0x400000U)
#define AIPS_OPACRJ_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRJ_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_SP2_SHIFT)) & AIPS_OPACRJ_SP2_MASK)
/*! @} */

/*! @name OPACRK - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRK_TP6_MASK                     (0x10U)
#define AIPS_OPACRK_TP6_SHIFT                    (4U)
/*! TP6 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRK_TP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_TP6_SHIFT)) & AIPS_OPACRK_TP6_MASK)

#define AIPS_OPACRK_WP6_MASK                     (0x20U)
#define AIPS_OPACRK_WP6_SHIFT                    (5U)
/*! WP6 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRK_WP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_WP6_SHIFT)) & AIPS_OPACRK_WP6_MASK)

#define AIPS_OPACRK_SP6_MASK                     (0x40U)
#define AIPS_OPACRK_SP6_SHIFT                    (6U)
/*! SP6 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRK_SP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_SP6_SHIFT)) & AIPS_OPACRK_SP6_MASK)

#define AIPS_OPACRK_TP3_MASK                     (0x10000U)
#define AIPS_OPACRK_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRK_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_TP3_SHIFT)) & AIPS_OPACRK_TP3_MASK)

#define AIPS_OPACRK_WP3_MASK                     (0x20000U)
#define AIPS_OPACRK_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRK_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_WP3_SHIFT)) & AIPS_OPACRK_WP3_MASK)

#define AIPS_OPACRK_SP3_MASK                     (0x40000U)
#define AIPS_OPACRK_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRK_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_SP3_SHIFT)) & AIPS_OPACRK_SP3_MASK)

#define AIPS_OPACRK_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRK_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRK_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_TP1_SHIFT)) & AIPS_OPACRK_TP1_MASK)

#define AIPS_OPACRK_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRK_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRK_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_WP1_SHIFT)) & AIPS_OPACRK_WP1_MASK)

#define AIPS_OPACRK_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRK_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRK_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_SP1_SHIFT)) & AIPS_OPACRK_SP1_MASK)

#define AIPS_OPACRK_TP0_MASK                     (0x10000000U)
#define AIPS_OPACRK_TP0_SHIFT                    (28U)
/*! TP0 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRK_TP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_TP0_SHIFT)) & AIPS_OPACRK_TP0_MASK)

#define AIPS_OPACRK_WP0_MASK                     (0x20000000U)
#define AIPS_OPACRK_WP0_SHIFT                    (29U)
/*! WP0 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRK_WP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_WP0_SHIFT)) & AIPS_OPACRK_WP0_MASK)

#define AIPS_OPACRK_SP0_MASK                     (0x40000000U)
#define AIPS_OPACRK_SP0_SHIFT                    (30U)
/*! SP0 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRK_SP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRK_SP0_SHIFT)) & AIPS_OPACRK_SP0_MASK)
/*! @} */

/*! @name OPACRL - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRL_TP7_MASK                     (0x1U)
#define AIPS_OPACRL_TP7_SHIFT                    (0U)
/*! TP7 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRL_TP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_TP7_SHIFT)) & AIPS_OPACRL_TP7_MASK)

#define AIPS_OPACRL_WP7_MASK                     (0x2U)
#define AIPS_OPACRL_WP7_SHIFT                    (1U)
/*! WP7 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRL_WP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_WP7_SHIFT)) & AIPS_OPACRL_WP7_MASK)

#define AIPS_OPACRL_SP7_MASK                     (0x4U)
#define AIPS_OPACRL_SP7_SHIFT                    (2U)
/*! SP7 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRL_SP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_SP7_SHIFT)) & AIPS_OPACRL_SP7_MASK)

